app/controllers/welcome_controller.rb

    def index
        # Creates an array of states that our user can choose from on our index page
        @states = %w(HI AK CA OR WA ID UT NV AZ NM CO WY MT ND SD NB KS OK
    		 TX LA AR MO IA MN WI IL IN MI OH KY TN MS AL GA FL SC NC VA WV DE MD PA NY
    		 NJ CT RI MA VT NH ME DC).sort!



        location_exists = false
        Location.all.each do |location|
        	if location.city == params[:city] && location.state == params[:state]
        		location_exists = true
        	end
        end

        if location_exists == false 	# !location_exists
        	Location.create(city: params[:city], state: params[:state])
        end

        @locations = Location.order(:city)
---
SELECT "locations".* FROM "locations"
INSERT INTO "locations" ("city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["city", ""], ["state", "GA"], ["created_at", 2017-07-30 00:22:40 UTC], ["updated_at", 2017-07-30 00:22:40 UTC]]
SELECT "locations".* FROM "locations" ORDER BY "locations"."city" ASC